In [1]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\aayush\anaconda3\lib\site-packages (2.2.9)

In [8]:
import mysql.connector  #importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "pythonclass8am"
)
db = database.cursor()

In [9]:
db.execute("SELECT * FROM student")
result = db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Shyam', 78, 76, 90, 67, 89, 412, 82.5, 'A'),
 (2, 'Ram', 78, 87, 67, 89, 87, 450, 85.5, 'A'),
 (3, 'Sabin', 78, 89, 89, 45, 67, 400, 81.4, 'B')]

In [17]:
db.execute("SELECT sn,name FROM student")
result = db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Shyam'), (2, 'Ram'), (3, 'Sabin'), (4, 'Shyam'), (5, 'Shyama')]

In [10]:
db.execute("SELECT * FROM student WHERE grade = 'A'")
result = db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Shyam', 78, 76, 90, 67, 89, 412, 82.5, 'A'),
 (2, 'Ram', 78, 87, 67, 89, 87, 450, 85.5, 'A')]

In [11]:
db.execute("SELECT * FROM student WHERE grade = 'A' and math > 70")
result = db.fetchall()
# for x in result:
#     print(x)
result

[(1, 'Shyam', 78, 76, 90, 67, 89, 412, 82.5, 'A')]

In [12]:
# INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `per`, `grade`) VALUES ('4', 'Shyam', '78', '60', '65', '70', '78', '410', '81.4', 'A');
sql = '''INSERT INTO student ( name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES ('Shyam', 78, 60, 75, 70, 78, 410, 81.4, 'A')'''
db.execute(sql)
database.commit()

In [13]:
name = input("Enter name = ")
physics = int(input("Enter physics marks = "))
chemistry = int(input("Enter chemistry marks = "))
math = int(input("Enter math marks = "))
english = int(input("Enter english marks = "))
nepali = int(input("Enter nepali marks = "))

total = physics + chemistry + math + english + nepali
per = total/5

if per >= 80:
    grade = "A"
elif per >=60:
    grade = "B"
elif per >= 45:
    grade = "C"
else:
    grade = "F"
    
print("Your Total = ",total)
print("Your Per = ",per)
print("Your Grade = ",grade)

sql = f'''INSERT INTO student ( name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')'''
db.execute(sql)
database.commit()
print(sql)

Enter name = Sabin
Enter physics marks = 90
Enter chemistry marks = 87
Enter math marks = 67
Enter english marks = 89
Enter nepali marks = 67
Your Total =  400
Your Per =  80.0
Your Grade =  A
INSERT INTO student ( name, physics, chemistry, math, english, nepali, total, per, grade)
VALUES ('Sabin', 90, 87, 67, 89, 67, 400, 80.0, 'A')

In [14]:
sql = f'''DELETE FROM student WHERE sn = 6'''
db.execute(sql)
database.commit()
print(sql)

DELETE FROM student WHERE sn = 6

In [15]:
sql = f'''UPDATE  student SET name = 'Shyama' WHERE sn = 5'''
db.execute(sql)
database.commit()
print(sql)

UPDATE  student SET name = 'Shyama' WHERE sn = 5